Revit 2024 API
EnergyAnalysisSpace.SpaceName Property
 The name.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public string SpaceName { get; }
Visual Basic
Public ReadOnly Property SpaceName As String
	Get
Visual C++
public:
property String^ SpaceName {
	String^ get ();
}
See Also
EnergyAnalysisSpace Class
Autodesk.Revit.DB.Analysis Namespace